#### Pandas- DataFrame and Series
Pandas is a powerful data manupulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structure: Series and DataFrame.
- A series is a one dimentional array like object
- a dataframe is a two dimentional, size-mutable and potentially heterogeneous tabular data structure with labled asex(row and column)

In [12]:
import pandas as pd
import numpy as np

In [ ]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.
data = [1,2,3,4,5,6]
series1 = pd.Series(data)
print(f"Series:\n {series1}")
print(type(series1))
#we will also see a built in default index on the left side

Series:
 0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
## Create a series from dict elements
data = {"a":1, "b":2, "c":3}
series2 = pd.Series(data)
print(series2)
#from the dict key will be consider as a index and value will be consider as a series value

a    1
b    2
c    3
dtype: int64

In [8]:
#we can also give our own index 
data =[10,20,30,40,50]
index = ['a','b','c','d','e']
s3 = pd.Series(data, index= index)
print(s3)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [31]:
##DataFrame- two dimentional, hetegeneous
#create a dataframe from a dictionary of list----> value will be in list form 
data = {
    "Name": ['rhs2', 'rhs6','sio'],
    "Age": [25,30,45],
    "City": ['NY', 'Shanghai', 'Berlin']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age      City
0  rhs2   25        NY
1  rhs6   30  Shanghai
2   sio   45    Berlin
<class 'pandas.core.frame.DataFrame'>

In [17]:
#we can also use numpy on that
array1 = np.array(df)
print(array1)

[['rhs2' 25 'NY']
 ['rhs6' 30 'Shanghai']
 ['sio' 45 'Berlin']]

In [ ]:
##Create a dataframe from list of dictionaries
data1 = [
    {'Name':'rhs2','Age':32,'City':'shanghai'},
    {'Name':'John','Age':34,'City':'ny'},
    {'Name':'rhs6','Age':24,'City':'berlin'},
    {'Name':'sio','Age':40,'City':'chicago'}
]
df = pd.DataFrame(data1)
print(df)
print(type(df))

   Name  Age      City
0  rhs2   32  shanghai
1  John   34        ny
2  rhs6   24    berlin
3   sio   40   chicago
<class 'pandas.core.frame.DataFrame'>

In [42]:
df1= pd.read_csv("sales_data.csv")

In [43]:
#to check first 10 elements from the csv file--> top 5 record
df1.head(10)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
5,10006,2024-01-06,Sports,Wilson Evolution Basketball,5,29.99,149.95,Asia,Credit Card
6,10007,2024-01-07,Electronics,MacBook Pro 16-inch,1,2499.99,2499.99,North America,Credit Card
7,10008,2024-01-08,Home Appliances,Blueair Classic 480i,2,599.99,1199.98,Europe,PayPal
8,10009,2024-01-09,Clothing,Nike Air Force 1,6,89.99,539.94,Asia,Debit Card
9,10010,2024-01-10,Books,Dune by Frank Herbert,2,25.99,51.98,North America,Credit Card

In [44]:
#to get last 10 record 
df1.tail(10)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
230,10231,2024-08-18,Clothing,Adidas Originals Trefoil Hoodie,4,64.99,259.96,Asia,Debit Card
231,10232,2024-08-19,Books,Dune by Frank Herbert,2,9.99,19.98,North America,Credit Card
232,10233,2024-08-20,Beauty Products,Fresh Sugar Lip Treatment,1,24.00,24.00,Europe,PayPal
233,10234,2024-08-21,Sports,Hydro Flask Standard Mouth Water Bottle,3,32.95,98.85,Asia,Credit Card
234,10235,2024-08-22,Electronics,Bose QuietComfort 35 II Wireless Headphones,1,299.00,299.00,North America,Credit Card
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [36]:
#accessing data from data 
#if i take one column from a dataframe we get a series
print(df['Name'])
type(df['Name'])

0    rhs2
1    rhs6
2     sio
Name: Name, dtype: object

pandas.core.series.Series

In [ ]:
df.loc[0]
#picup 0th row index

Name    rhs2
Age       25
City      NY
Name: 0, dtype: object

In [40]:
df.iloc[1]
#picup column index location

Name        rhs6
Age           30
City    Shanghai
Name: 1, dtype: object

In [41]:
df.iloc[0][0]

/var/folders/6m/3zjbwlfj0fz0x5x4jry9t9dh0000gn/T/ipykernel_2519/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'rhs2'

In [51]:
##accsessing a specified element
print(df.at[1,'Age'])

30

In [54]:
print(df.at[2,'Age'])

45

In [55]:
print(df.at[2,'Name'])

sio

In [ ]:
#accessing specified element with iat
df.iat[2,2]
df.iat[1,2]

'Shanghai'

In [58]:
##Data Manupulations with dataframe
df

   Name  Age      City
0  rhs2   25        NY
1  rhs6   30  Shanghai
2   sio   45    Berlin

In [59]:
#adding a new column as salary
df['salary']=[50000,60000,70000]

In [66]:
df

   Name  Age      City  salary
0  rhs2   25        NY   50000
1  rhs6   30  Shanghai   60000
2   sio   45    Berlin   70000

In [67]:
#remove a column
#by default it will check row index so row index does not have a salary so we need to provide axis
df.drop('salary', axis=1)

   Name  Age      City
0  rhs2   25        NY
1  rhs6   30  Shanghai
2   sio   45    Berlin

In [69]:
#even though we drop salary it is coming again, it is not a permanent operation to make it permanent use inplace param
df.drop('salary', axis=1, inplace=True)

In [70]:
df

   Name  Age      City
0  rhs2   25        NY
1  rhs6   30  Shanghai
2   sio   45    Berlin

In [71]:
# add age to the column
df['Age']+=1

In [72]:
df

   Name  Age      City
0  rhs2   26        NY
1  rhs6   31  Shanghai
2   sio   46    Berlin

In [ ]:
#drop based on row index 
df.drop(0)

   Name  Age      City
1  rhs6   31  Shanghai
2   sio   46    Berlin

In [74]:
df

   Name  Age      City
0  rhs2   26        NY
1  rhs6   31  Shanghai
2   sio   46    Berlin

In [75]:
#again that was not permanent so make it permanent use inplace
df.drop(0, inplace=True)

In [76]:
df

   Name  Age      City
1  rhs6   31  Shanghai
2   sio   46    Berlin

In [77]:
df1.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [81]:
# Display the data types of each column
print("Data types:\n", df1.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df1.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [80]:
df1.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000